{
  "back": "<== Back",
  "Just_input": "Just input",
  "road": "Road.map()",
  "guides": "Guides",
  "articles": "Articles",
  "slogan": "Simple service for learning programming",
  "chooseGuide": "Choose guide",
  "author": "Author",
  "about": "About us",
  "article-why-us": {
    "title": "About our service",
    "title-helper": "Small article about us.",
    "paragraph_1": "Road.map() is a service that allows you to quickly learn and find relevant programming topics, and we also provide a brief description of them.",
    "paragraph_2": "We don't teach programming, we just provide the necessary vector for development, making it easier for a beginner.",
    "paragraph_3": "What makes us better than other similar services: the structure of data submission, the volume of various articles, the convenience of setting up the environment, the absence of additional registrations and troubles.",
    "paragraph_4": "This service is written in Vue js and is completely open source. ",
    "paragraph_5": "Why Vue? Vue is a progressive js framework, yet it uses an html first approach and is declarative. Vue is well suited for writing small startups and applications, while unlike svelte it feels good on medium-sized projects. What when it comes to large projects, corporate Angular and general-purpose React excel."
  },
  "greetings": {
    "article-greeting": "Road.map (Articles)",
    "article-greeting-helper": "This page is a collection of all our articles",
    "guides-greeting": "Road.map (Guides)",
    "guides-greeting-helper": "This page is a collection of all our guides"
  },
  "technologies": {
    "dev-dir": "Develop direction",
    "technologies": "Technologies",
    "frontend": "Frontend",
    "backend": "Backend",
    "kotlin": "Mobile kotlin",
    "swift": "Mobile swift",
    "qa": "QA Engineer",
    "ux": "UX Design",
    "vue-js": "Vue Js",
    "laravel": "Laravel",
    "Kotlin": "Kotlin",
    "Swift": "Swift",
    "html": "Html",
    "js": "JavaScript",
    "css": "Css",
    "react": "React",
    "angular": "Angular"
  },
  "articles-titles": {
    "about": "What can we offer ?",
    "how-learning-faster": "How learning faster ?",
    "what-is-mobile-develop": "What is Mobile develop ?",
    "which-backend-framework-is-best": "Which Backend framework is best?",
    "what-dev-ops-developer-doing": "What Dev ops developer doing ?"
  },
  "frontend-page": {
    "article_1-title": "What is frontend?",
    "paragraph_1-1": "Front-end development is the development of visual and interactive elements of a website that users interact with directly. It's a combination of HTML, CSS and JavaScript, where HTML provides the structure, CSS the styling and layout, and JavaScript the dynamic behaviour and interactivity.",
    "paragraph_1-2": "As a front-end developer, you'll be responsible for creating the user interface of a website, to ensure it looks good and is easy to use, with great focus on design principles and user experience. You'll be working closely with designers, back-end developers, and project managers to make sure the final product meets the client's needs and provides the best possible experience for the end-users.",
    "article_2-title": "Base",
    "article_2-label": "More about base",
    "paragraph_2-1": "HTML is a markup language that defines the structure of your content. HTML consists of a series of elements, which you use to enclose, or wrap, different parts of the content to make it appear a certain way, or act a certain way. ",
    "paragraph_2-2": "Like HTML, CSS is not a programming language. It's not a markup language either. CSS is a style sheet language.",
    "paragraph_2-3": "JavaScript is a programming language that adds interactivity to your website. This happens in games, in the behavior of responses when buttons are pressed or with data entry on forms; with dynamic styling; with animation, etc. ",
    "article_3-title": "Git",
    "article_3-label": "More about Git",
    "paragraph_3-1": "Git is a console utility for tracking and maintaining a history of file changes in your project. Most often it is used for code, but it can be used for other files as well.",
    "paragraph_3-2": "With Git, you can rollback your project to an older version, compare, analyze, or merge your changes into a repository.",
    "paragraph_3-3": "A repository is a repository of your code and a history of its changes. Git works locally and all your repositories are stored in specific folders on your hard drive.",
    "article_4-title": "Frameworks",
    "article_4-label": "More about Frameworks",
    "paragraph_4-1": "Front-end frameworks facilitate web developers' jobs by providing them with reusable code modules, standardized front-end technologies, and ready-made interface blocks that ease the development of applications and user interfaces without the need to code every function or object from scratch.",
    "paragraph_4-2": "As most web applications offer very similar – or sometimes identical – structures, front-end frameworks have been developed to provide a common structure, so developers do not have to write everything from scratch.",
    "paragraph_4-3": "Knowing which front-end framework is the best on the market has always been controversial. However, recent studies and surveys show that currently, the most popular front-end frameworks are React, Vue, Angular, Svelte. ",
    "article_5-title": "Other tools",
    "article_5-label": "More about Other tools",
    "paragraph_5-1": "A CSS framework provides the user with a fully functional CSS stylesheet, allowing them to create a web page by simply coding the HTML with appropriate classes, structure, and IDs.",
    "paragraph_5-2": "Type checker helps developers write code with fewer bugs by adding types to their code, trying to catch type errors within your code, and then removing them during compile time.",
    "paragraph_5-3": "Common usages of task runners include numerous development tasks such as: spinning up development servers, compiling code (ex. SCSS to CSS) and running linters, serving files up from a local port on your computer.",
    "paragraph_5-4": "CSS Preprocessors are scripting languages that extend the default capabilities of CSS.",
    "article_6-title": "Tests",
    "article_6-label": "More about tests",
    "paragraph_6-1": "Before delivering your application to users, you need to be sure that your app meets the requirements it was designed for, and that it doesn`t do any weird, unintended things (called `bugs`).",
    "paragraph_6-2": "There are many types of tests: unit / integration / e2e tests, testing pyramids, red-green refactors, TDD and BDD, screenshot tests.",
    "article_7-title": "Forms of web apps",
    "article_7-label": "More about froms of web apps",
    "paragraph_7-1": "A static site generator is a tool that generates a full static HTML website based on raw data and a set of templates. Essentially, a static site generator automates the task of coding individual HTML pages and gets those pages ready to serve to users ahead of time. Because these HTML pages are pre-built, they can load very quickly in users` browsers.",
    "paragraph_7-2": "Server-side rendering refers to the process that the service side completes the HTML structure splicing of the page, sends it to the browser, and then binds the status and events for it to become a fully interactive page.",
    "paragraph_7-3": "Progressive Web Apps (PWAs) are websites that are progressively enhanced to function like installed, native apps on supporting platforms, while functioning like regular websites on other browsers.",
    "paragraph_7-4": "A while back, developing a mobile app using JavaScript was impossible. But now JavaScript developers can create mobile and desktop using their knowledge for web development."
  },
  "base-frontend": {
    "article_1-title": "Html",
    "paragraph_1": "HTML stands for HyperText Markup Language. It is used on the frontend and gives the structure to the webpage which you can style using CSS and make interactive using JavaScript.",
    "article_1-label": "More about html",
    "article_2-title": "Css",
    "paragraph_2": "CSS or Cascading Style Sheets is the language used to style the frontend of any website. CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.",
    "article_2-label": "More about css",
    "article_3-title": "JavaScript",
    "paragraph_3": "JavaScript allows you to add interactivity to your pages. Common examples that you may have seen on the websites are sliders, click interactions, popups and so on.",
    "article_3-label": "More about JavaScript"
  },
  "html": {
    "article_1-title": "Html anatomy",
    "paragraph_1": "The main parts of our element are: Start tag, End tag, Content, Element.",
    "paragraph_1-2": "Start tag: Consists of the element name enclosed in opening and closing angle brackets. The start tag indicates where the element starts or takes effect.",
    "paragraph_1-3": "End tag: This is the same as the start tag, except that it includes a slash in front of the element name. The closing element indicates where the element ends, in this case where the paragraph ends. Missing a closing tag is one of the most common beginner mistakes and can lead to strange results.",
    "paragraph_1-4": "Content: This is the content of the element, which in this case is just text.",
    "paragraph_1-5": "Element: The start tag, end tag, and content together make up an element.",
    "paragraph_1-6": "Attributes contain additional information about the element that you don't want to show in the actual content. ",
    "article_2-title": "Semantic HTML",
    "paragraph_2": "Semantic element clearly describes its meaning to both the browser and the developer. In HTML, semantic element are the type of elements that can be used to define different parts of a web page such as <form>, <table>, <article>, <header>, <footer>, etc.",
    "article_3-title": "Forms and Validations",
    "paragraph_3": "Before submitting data to the server, it is important to ensure all required form controls are filled out, in the correct format. This is called client-side form validation, and helps ensure data submitted matches the requirements set forth in the various form controls.",
    "article_4-title": "Accessibility",
    "paragraph_4": "Web accessibility means that websites, tools, and technologies are designed and developed in such a way that people with disabilities can use them easily.",
    "article_5-title": "Basics of SEO",
    "paragraph_5": "SEO or Search Engine Optimization is the technique used to optimize your website for better rankings on search engines such as Google, Bing etc."
  },
  "css": {
    "article_1-title": "Anatomy of a CSS ruleset",
    "paragraph_1": "Selector: This is the HTML element name at the start of the ruleset. It defines the element(s) to be styled. To style a different element, change the selector.",
    "paragraph_1-2": "Declaration: It specifies which of the element's properties you want to style.",
    "paragraph_1-3": "Properties: These are ways in which you can style an HTML element. In CSS, you choose which properties you want to affect in the rule.",
    "paragraph_1-4": "Property value: To the right of the property—after the colon—there is the property value. This chooses one out of many possible appearances for a given property.",
    "article_2-title": "Making layouts",
    "paragraph_2": "Float, grid, flexbox, positioning, display and box model are some of the key topics that are used for making layouts.",
    "paragraph_2-2": "The float CSS property places an element on the left or right side of its container, allowing text and inline elements to wrap around it. The element is removed from the normal flow of the page, though still remaining a part of the flow (in contrast to absolute positioning).",
    "paragraph_2-3": "CSS grid layout introduces a two-dimensional grid system to CSS. Grids can be used to lay out major page areas or small user interface elements. ",
    "paragraph_2-4": "The flexible box layout module, usually referred to as flexbox, was designed as a one-dimensional layout model, and as a method that could offer space distribution between items in an interface and powerful alignment capabilities.",
    "paragraph_2-5": "The position CSS property sets how an element is positioned in a document. The top, right, bottom, and left properties determine the final location of positioned elements.",
    "paragraph_2-6": "The display CSS property sets whether an element is treated as a block or inline box and the layout used for its children, such as flow layout, grid or flex.",
    "article_3-title": "Responsive Web Design",
    "paragraph_3": "Responsive Web Designing is the technique to make your webpages look good on all screen sizes. There are certain techniques used to achieve that e.g. CSS media queries, percentage widths, min or max widths heights etc.",
    "paragraph_3-2": "Media queries allow you to apply CSS styles depending on a device's general type (such as print vs. screen) or other characteristics such as screen resolution or browser viewport width."
  },
  "js": {
    "article_1-title": "Foreword",
    "paragraph_1": "JavaScript is arguably more difficult to learn than related technologies such as HTML and CSS. Before attempting to learn JavaScript, you are strongly advised to get familiar with at least these two technologies first, and perhaps others as well. ",
    "article_2-title": "Syntax and basic constructs",
    "paragraph_2": "JavaScript is a case sensitive language. This means that keywords, variable and function names, and any other language identifiers must always contain the same set of uppercase and lowercase letters.",
    "paragraph_2-2": "JavaScript ignores spaces that may be present between tokens in a program. In addition, JavaScript also ignores newlines for the most part. Therefore, spaces and newline characters can be used without restriction in the source texts of programs for formatting and giving them a readable appearance.",
    "paragraph_2-3": "Like other programming languages, JavaScript uses a semicolon (;) to separate instructions from one another. The use of semicolons is essential to make the programmer's intent clear: without this separator, one can mistake the end of one statement for the beginning of the next, and vice versa.",
    "article_3-title": "Data types",
    "paragraph_3": "Data types in JavaScript can be divided into two categories: simple types and objects. The category of simple types in JavaScript includes numbers, text strings, and logical (or boolean) values.",
    "paragraph_3-2": "The special values null and undefined are elementary values, but they do not refer to numbers, strings, or booleans. Each of them defines only one value of its own special type.",
    "paragraph_3-3": "Any value in JavaScript that is not a number, string, boolean, or the special value null or undefined is an object. An object (that is, a member of an object data type) is a collection of properties, each of which has a name and a value (either of a simple type, such as a number or a string, or of an object type).",
    "paragraph_3-4": "An ordinary JavaScript object is an unordered collection of named values. In addition, JavaScript has a special type of object known as an array, which represents an ordered collection of numbered values. JavaScript has special syntax for working with arrays.",
    "article_4-title": "DOM Manipulation",
    "paragraph_4": "The Document Object Model (DOM) is a programming interface built for HTML and XML documents. It represents the page that allows programs and scripts to dynamically update the document structure, content, and style. With DOM, we can easily access and manipulate tags, IDs, classes, attributes, etc.",
    "article_5-title": "Fetch API",
    "paragraph_5": "Ajax is the technique that lets us send and receive the data asynchronously from the servers e.g. updating the user profile or asynchronously fetching the list of searched products without reloading the page.",
    "article_6-title": "Modern JavaScript",
    "paragraph_6": "ECMAScript 2015 or ES2015 is a significant update to the JavaScript programming language. It is the first major update to the language since ES5 which was standardized in 2009. You should look at the features introduced with ES6 and onwards.",
    "article_7-title": "JavaScript Concepts",
    "paragraph_7": "JavaScript Hoisting refers to the process whereby the interpreter appears to move the declaration of functions, variables or classes to the top of their scope, prior to execution of the code",
    "paragraph_7-2": "Event Bubbling is a concept in the DOM (Document Object Model). It happens when an element receives an event, and that event bubbles up (or you can say is transmitted or propagated) to its parent and ancestor elements in the DOM tree until it gets to the root element.",
    "paragraph_7-3": "Scope determines the visibility or accessibility of a variable (another resource) in the scope of your code.",
    "paragraph_7-4": "Prototypes are the mechanism by which JavaScript objects inherit features from one another. ",
    "paragraph_7-5": "An important aspect of web components is encapsulation — being able to keep the markup structure, style, and behavior hidden and separate from other code on the page so that different parts do not clash, and the code can be kept nice and clean. The Shadow DOM API is a key part of this, providing a way to attach a hidden separated DOM to an element. ",
    "paragraph_7-6": "JavaScript's strict mode is a way to opt in to a restricted variant of JavaScript, thereby implicitly opting-out of 'sloppy mode'. Strict mode isn't just a subset: it intentionally has different semantics from normal code. Browsers not supporting strict mode will run strict mode code with different behavior from browsers that do, so don't rely on strict mode without feature-testing for support for the relevant aspects of strict mode. Strict mode code and non-strict mode code can coexist, so scripts can opt into strict mode incrementally."
  }
}
